![](https://blog.socialcops.com/wp-content/uploads/2016/07/OG-MachineLearning-Python-Titanic-Kaggle.png)

In [1]:
%%html
<style>
@import url('https://fonts.googleapis.com/css?family=Ewert|Roboto&effect=3d|ice|');
body {background-color: gainsboro;} 
a {color: #000000; font-family: 'Roboto';} 
h1 {color: #000000; font-family: 'Orbitron'; text-shadow: 4px 4px 4px #aaa;} 
h2, h3 {color: slategray; font-family: 'Orbitron'; text-shadow: 4px 4px 4px #aaa;}
h4 {color: #818286; font-family: 'Roboto';}
span {font-family:'Roboto'; color:black; text-shadow: 5px 5px 5px #aaa;}  
div.output_area pre{font-family:'Roboto'; font-size:110%; color:lightblue;}      
</style>

In [15]:
from scipy.stats import pearsonr

In [16]:
import numpy as np
import pandas as pd

import  matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set_style("whitegrid")

In [17]:
df_train = pd.read_csv("Data/train.csv")
df_test = pd.read_csv("Data/test.csv")

In [18]:
df_train.drop(['Name'],1,inplace =True)
df_train.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [19]:
df_test.drop(["Name"],1, inplace =True)
df_test.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
print("Shape Of Training Data:", df_train.shape)
print("Shape Of Test Data :", df_test.shape)

Shape Of Training Data: (891, 11)
Shape Of Test Data : (418, 10)

In [21]:
print("Missing Values In Training Dataset: ", df_train.isnull().sum())
print("-"*50)
print("Missing Values In Test Dataset : ", df_test.isnull().sum())

Missing Values In Training Dataset:  PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
--------------------------------------------------
Missing Values In Test Dataset :  PassengerId      0
Pclass           0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

#### Removing Missing Values In "Embarked"
> Data can have missing values for a number of reasons such as observations that were not recorded and data corruption.
Handling missing data is important as many machine learning algorithms do not support data with missing values.

In [22]:
df_train.drop(['Cabin'], 1 ,inplace =True)
df_test.drop(['Cabin'],1 , inplace =True)

In [23]:
df_train.drop(['Ticket'], 1, inplace = True)
df_test.drop(['Ticket'], 1, inplace = True)

In [24]:
df_train.dropna(subset=['Embarked'],inplace =True)

In [25]:
df_test['Fare'] =df_test['Fare'].fillna(35)

In [26]:
df_test.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0          892       3    male  34.5      0      0   7.8292        Q
1          893       3  female  47.0      1      0   7.0000        S
2          894       2    male  62.0      0      0   9.6875        Q
3          895       3    male  27.0      0      0   8.6625        S
4          896       3  female  22.0      1      1  12.2875        S

In [27]:
df_test.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            0
Embarked        0
dtype: int64

In [28]:
df_train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [29]:
df_train['Age'].describe()

count    712.000000
mean      29.642093
std       14.492933
min        0.420000
25%       20.000000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [30]:
df_train.groupby('Survived')['Survived'].value_counts()

Survived  Survived
0         0           549
1         1           340
Name: Survived, dtype: int64

In [31]:
df_train.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.193299
Name: Age, dtype: float64

In [32]:
df_train.groupby(['Survived','Sex','Pclass'])['Age'].mean()

Survived  Sex     Pclass
0         female  1         25.666667
                  2         36.000000
                  3         23.818182
          male    1         44.581967
                  2         33.369048
                  3         27.255814
1         female  1         34.562500
                  2         28.080882
                  3         19.329787
          male    1         36.248000
                  2         16.022000
                  3         22.274211
Name: Age, dtype: float64

In [33]:
#Training Data
age_groupby_train = df_train.groupby(['Survived','Sex','Embarked','Pclass'])['Age'].mean()

In [34]:
#Test Data
age_groupby_test = df_test.groupby(['Sex','Embarked','Pclass'])['Age'].mean()

## Train Data Age Missing Values Replacement By Mean Values Basis On
* Sex
* Embarked
* Pclass

In [35]:
df_train['Age'].fillna(value = -1,inplace =True)

In [36]:
for row in range(len(age_groupby_train.index)):
    df_train.loc[(df_train['Survived'] == age_groupby_train.index[row][0]) &
           (df_train['Sex']== age_groupby_train.index[row][1]) &
           (df_train['Embarked']== age_groupby_train.index[row][2])&
           (df_train['Pclass']== age_groupby_train.index[row][3])&
           (df_train['Age']==-1),'Age']=age_groupby_train.values[row]

## Test Data Age Missing Values Replacement By Mean Values Basis On
* Sex
* Embarked
* Pclass

In [37]:
df_test['Age'].fillna(value = -1,inplace =True)

In [38]:
for row in range(len(age_groupby_test.index)):
    df_test.loc[(df_test['Sex']== age_groupby_test.index[row][0]) &
           (df_test['Embarked']== age_groupby_test.index[row][1])&
           (df_test['Pclass']== age_groupby_test.index[row][2])&
           (df_test['Age']==-1),'Age']=age_groupby_test.values[row]

In [39]:
print("Missing Values of Age in Training Dataset :", df_train.isnull().sum() )
print("Missing Values of Age in Test Dataset :", df_test.isnull().sum() )

Missing Values of Age in Training Dataset : PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64
Missing Values of Age in Test Dataset : PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [40]:
df_train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [60]:
import pandas_profiling as pp
pp.ProfileReport(df_train)

Tab(children=(HTML(value='<div id="overview-content" class="row variable spacing">\n    <div class="row">\n   â€¦

### Label Enconder

In [41]:
from sklearn.preprocessing import LabelEncoder

### Label Encoding

###### Male   ->  1

###### Female ->  0

In [42]:
le = LabelEncoder()
le.fit(df_train["Sex"])
df_train.loc[:,'Sex'] = le.transform(df_train['Sex'])

le.fit(df_train["Embarked"])
df_train.loc[:,'Embarked'] = le.transform(df_train['Embarked'])

le = LabelEncoder()
le.fit(df_test["Sex"])
df_test.loc[:,'Sex'] = le.transform(df_test['Sex'])

le.fit(df_test["Embarked"])
df_test.loc[:,'Embarked'] = le.transform(df_test['Embarked'])

In [43]:
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

### Split Data In X ,y

In [44]:
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

In [45]:
train_x = df_train[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]

In [46]:
train_y =df_train[['Survived']]

In [47]:
train_x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [48]:
train_y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [49]:
from sklearn.linear_model import LogisticRegression

In [50]:
lr = LogisticRegression()

In [51]:
lr.fit(train_x,train_y)

C:\Users\Flash\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
C:\Users\Flash\Anaconda3\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [52]:
test_y = df_test[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]

In [53]:
PassengerId =df_test['PassengerId']

In [54]:
preds_y = lr.predict(test_y)

In [55]:
submission = pd.DataFrame({'PassengerId':PassengerId,'Survived':preds_y})
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [56]:
filename = 'Titanic_Predictions_1.csv'

submission.to_csv(filename,index=False)

print('Saved file: ' + filename)

Saved file: Titanic_Predictions_1.csv

In [57]:
pr = pd.read_csv(filename)

In [58]:
pr.shape

(418, 2)